[
  
  {
    "img": "https://img.freepik.com/free-photo/business-women-signature-document_1388-90.jpg?w=826&t=st=1695563480~exp=1695564080~hmac=0580e663965413fcafffef8ba35e52f9998c9b6a204c9f725611b7457cef43c8",
    "topic": "Designing Curriculum / Syllabus for ESL Classroom - Part I",
    "content": "Language teaching consists of various sequences of activities. Designing a relevant curriculum and teaching aids are the most crucial process involved in  language teaching.The curriculum and the teaching aids facilitate the teachers and the learners to create a structure for the teaching and learning process. They also define the quality of the teaching and learning process. There are various factors that have to be kept in mind while designing a curriculum. It should contain a standard quality to meet the learners’ expectations and needs. This paper focuses on the various techniques and the key factors beneficial for designing a pertinent curriculum and teaching aids for the ESL classroom.\n\nWhat is Curriculum?\nA curriculum design is the process of deciding on what and how students learn in a program in terms of knowledge skill and values. The curriculum includes subject offered from different area of language. Curriculum determines the amount of concentration and time to be allotted to each language area. Teaching material plays a major role in language teaching which are also known as the assisting resources required for student. When materials are chosen meticulously and utilized effectively it results in the improvement of teaching and learning process. They are to be placed on the first priority as they are the fundamental factor in teaching and learning process.\n\nBasic Traits of Teaching Materials:\nA teaching material should be informative, instructional, experimental and encouraging the learners to use and make discoveries in the language. The entire language teaching and learning industry has been constructed around the changing and developing teaching resource and methodologies. Human being are unique and have eight native intelligence, which he termed as inter personal, intrapersonal, musical, special, kinaesthetic, logical – mathematical, linguistical, spiritual and naturalistic, all this skills must be acknowledged and improved while teaching a language.\n\nTypes of Teaching Material:\nCourse books are the most commonly used primary source of input in language classroom. Course book plays a fundamental role in language learning all around the world. But course books are not completely flaw less, as they lack authenticity like being relevant to learners’ need. As most of the course books are based on the target language and its culture, learners fail to connect with the material. Teaching material can be broadly classified into two categories. The first type is creative material, which is created purposefully to meet particular teaching and learning objective. For example, there are wide ranges of availability of course books for language learning and teaching in today’s market. Some of the advantages of using an appropriate course book are providing a structure for the learning program and standardizing the process of instruction by maintaining quality. It accomplishes an extensive range of practical requirements. Course book provides a route map for both the teachers and learners and further assures sense of security for both the teachers and student. There are some disadvantages in using a particular course book. The real issues happening in the world are often avoided. Students learn the out – dated course books most of the time. Using only the course book reduce the role of teachers and their participation in the teaching and learning process. Besides the course books there are many other materials that can utilized for language teaching and learning. Audio material in the form of recordings related to language learning provides students with opportunities to learn the target language in academic context for example recordings of public lectures, online discussion etc. video materials are the most commonly used material to stimulate interest in language learning. Video consist of body language, facial expression and emotional impacts which connect to the unconscious mind of the learners which provides message visually and verbally.\n\nThe second type of material is the authentic material. These materials are not intentionally created for language learning or teaching purpose but are designed on a different principle, For example, journalism, entertainment etc. These materials are enormously potential for the language learning process. They bring a real content of present issue in the classroom through the target language. Through they are created for native speakers, it can be utilized for learning purpose for example, newspaper, advertisement, songs etc. Authentic text which are non- pedagogical text are used to enhanced not only the learners’ communication but also their cultural competency. They provide a real-life context that shows how the language is used by the native speakers. For example, movies and films are considered as the modern-day story telling instrument which are motivating, enjoyable and promotes successful language acquisition through real life conversation.",
    "date": "September 24, 2023",
    "id":"/a9f1d7e5"
  },
  {
    "img": "https://img.freepik.com/free-photo/freelance-young-businesswoman-casual-wear-using-laptop-working-living-room-home_7861-3051.jpg?w=1060&t=st=1695563660~exp=1695564260~hmac=f4bf1df70fd739cb62d369c795d9b1b231063ff33962a133f5467b4884242141",
    "topic": "Designing Curriculum / Syllabus for ESL Classroom - Part II",
    "content": "Students’ Need in Curriculum Designing:\nStudents, preference are to be considered crucial in designing language program curriculum and teaching material. The current structure of the curriculum has more useless repetitions of reading, writing and grammar subjects which must be replaced by innovative language learning subject. Students consider that there is a scarcity for appropriate teaching aids. Student must be facilitated with simplified version of curriculum so that they can understand the content. As there is a constant change in students’ need and technology of modern world, teachers must use the tools like digital audios, videos, language lab, headset and computers to be provided for the student to practice listening and speaking and for a better result of language teaching and learning. The goal of the language program is derived from the reason the learners’ need to learn the language. If a course material fails to meet the needs of the learners and does not satisfy the students’ wants and questions related to the target language, it also fails the quality of teaching and learning process. Implementing a curriculum must be directly related to the learners’ themselves, their needs and their character.\nKey characters about the learners to be considered by the curriculum designer when preparing the curriculum are:\n• Students’ Proficiency: All the learners may not have the equal amount of knowledge regarding the target language. Some students may lack the basic knowledge or some students may have a better knowledge regarding the target language but lack fluency. It is the role of the teacher to assess the level and the ability of the students in the target language and prepare the appropriate curriculum teaching material.\n• Background of the Learners: Due to the diversity among the students, their culture and lifestyle are different. Their reason for learning the target language is also a part of the diversity. The course material should be related to their culture so the students get connected to the course material and the learning process easily. \n• Students’ Requirement for Learning the Target Language: Each student would have a different requirement for learning a target language. Their requirements must be fulfilled by the course material. It must provide the learners what they are seeking for. Student who is seeking for a better-spoken skill cannot be provided with the entire course material of grammar and structure. Students must be provided with the appropriate course material which can meet their requirements. \nThe students’ learning setting divided into three division (The country – the school – the classroom) the first division deals in the national level like the culture, politics and religion where the students’ background contributes a lot to decide what to be taught and how to be taught for the learners. The second division, the school level relates to the school atmosphere and the staffs’ attitude towards the quality of teaching and learning process. In the classroom level the students and teachers’ rapport, their involvement and interest they have in the teaching and learning process are taken in account. \nFactors to Keep in Mind while Designing a Curriculum:\nDesigning appropriate material is not science it is a strange mixture of imagination, insight and analytical reasoning. As we have discussed before human being are unique and have eight native intelligence which he termed as inter personal, intrapersonal, musical, special, kinaesthetic, logical – mathematical, linguistical, spiritual and naturalistic. All these eight elements must be acknowledged by the curriculum. Teachers while designing the curriculum should keep in mind to maintain a balance among the students’ language learning needs, preference, motivations, expectations, affective filters and the institutional policies. The effectiveness of the material used for language teaching depends largely on how meaningful, relevant and motivational they are to the learners. \nThe curriculum is the primary source that helps the second language learners which also provide a rich experience of the language, multimedia resource and help the learners to discover themselves and become independent learners. Curriculum design is the process of deciding on what students learn in a program in terms of knowledge skill and value and how the learning should take place. A comprehensive set of factors are to be taken into account while designing a language curriculum. They are:\n• Environment Analysis: It includes a study of various factors which enhance the situation or setting of the language learning process. It also involves the understanding and eliminating the affective filters and the unnecessary subjects.\n• Need Analysis: It refers to the study on students’ expectations, objectives and their needs from the language program. The need analysis consists of two types of situational analysis. Target situation analysis which shows what the learners need to know and be able to do in the target language in order to function effectively in the target language. Present situation analysis which identifies the learners’ current ability to achieve their goal. The teacher should focus on both the situation analysis for a better curriculum quality.\n• Research Development: Research findings and development made in the field of language instruction and learning must be studied and utilized in the process of curriculum designing. \n• Contextual analysis: the structure of the curriculum, choice of teaching material, time allotted for each area of topics and facilities teachers can make use in their topics must be taken into account and dealt with care and learners’ need in mind. \nThere are three level to be followed in preparing a syllabus. Approach is the most fundamental and general level in the process of syllabus preparation. It refers to the view, belief or theory of language or language learning on which planning is built. In the second process namely designing the principles of the first level are converted into practical aspect of syllabus teaching aids. The decision regarding the arrangements of content to be taught and learned, different types of topics, subjects to be focused in the language field and so on are made in this level. In the third level called procedure the above planned and designed actions are implemented through appropriate techniques and the management of the classroom is taken care. \nThe syllabus is broadly classified into five types in the area of language teaching:\n• The grammatical structural syllabus is organized according to a set of grammatical structure of a particular language. All the rules and patterns in the usage of a particular language are memorized by the students. \n• Functional syllabus is based on the communicational and interpersonal uses to which language is put. It is basically contrast to the grammatical structural syllabus where the students practice the usage of the rules and pattern of a particular language. \n• Situational syllabus is where a set of conversation in everyday life’s situations and settings are practiced and performed in the classroom. Students get an exposure to the real-life usage of the language in this syllabus. \n• In the skill – based syllabus the learners’ role as a speaker, listener, reader and writer is given attention and taken care. Learners’ does in all the four fields of language skills are focused in the skill - based syllabus. \n• In the topic – based syllabus the use of topics and themes are its initial point. Students are presented with a particular topic based on a theme and are asked to discuss about it. Group discussion, self-introduction and debates are some of the examples of topic – based syllabus. \nBefore preparing a curriculum, one needs to know who the materials are targeted at, what level they are context in which the materials are to be used and how the language has to be presented and organized into teachable units or lessons.",
    "date": "September 24, 2023",
    "id":"/f2c8e4d3"
  },
  {
    "img": "https://img.freepik.com/free-vector/education-learning-concept-love-reading-people-reading-students-studying-preparing-examination-library-book-lovers-readers-modern-literature-flat-cartoon-vector-illustration_1150-60938.jpg?w=900&t=st=1695563686~exp=1695564286~hmac=222e7539154abe4a571214aa7491e60cb7c2447329d9db6e19af72456e883086",
    "topic": "Designing Curriculum / Syllabus for ESL Classroom - Part III",
    "content": "In - House Material:\nIn house - material are the course material developed by a particular teacher or a group of teachers for a particular course, particular group of students and with the available resource at a particular point of time. These materials are opposed to published material and are also referred to as tailor-made material, locally-produced material, self-designed material, internal-material, home-made material or home-grown material. In – house materials are commonly based on the existing learning material and authentic material and text. These materials may be adapted by means of different techniques. Some areas of language are sensitive to in – house material due to lack of published material in the particular area of language so the teachers are required to rely wholly on their self-designed material. On the other hand, the available material may be too region specific or too internationally oriented. Therefore, there some needs for replacement in the materials. Some of the reasons why teachers should build their own in–house material and the factors to keep in mind while designing in – house material.\nReasons to adopt in – house material:\n• Most of the learning materials produced worldwide are not generally aimed at a specific group of learners particularly their culture, ability, knowledge etc. So, majority of the students would find it difficult to connect with the published course material.\n• Most of the modern course books are filled with functions and speech acts based on the situation that the learner would have never encountered.\n• Globally designed books are mostly Anglo centric where the second language learners would find it hard to relate and respond.\n• Designing their own material facilitates the teachers to keep the local environment in mind and avoid the lack of fit of the course book.\n• In designing the in – house material the teacher can incorporate some of the elements in the learners’ first language.\n• Many other varieties of available material and tasks can be included and creative authentic materials can be utilized in the in – house material designing.\n• Materials can be modified or the difficulty of the learning target can be increase or decrease according to the learners’ need, ability and preference.\nFactors to consider while preparing in – house material:\n• The teaching material should be contextualized and at the same time it should also meet the criterion of authenticity.\n• The material must be interactive, generative, recyclable, flexible and evergreen in terms of language.\n• It should encourage and cover both the language and learning skills.\n• Teachers should focus on both the materials’ form as well as its function.\n• It should offer the students the opportunities to gain transferable skill.\n• The material should cover the learners’ need, preference and knowledge ability.\nAdaptation:\nAs described before in an in – house material designing adaptations of materials in order to improve them or to make the material more suitable and appropriate for a particular group or type of learners are necessary. The process of adaptation includes five steps namely adding, deleting, simplifying, reordering and replacing.\nAdding refers to the expanding and supplementing the existing materials and providing more material. It can be classified into two categories, extending - where the same type of materials is supplied more which is also known as quantitative change and expanding – which refers to adding something different to the existing material which is also known as qualitative change. Deleting refers to the removing or abridging a certain part or section from the existing material. It can also be classified into two categories, subtracting – in which some of the parts are extracted from the available material which is known as quantitative change and abridging – where certain parts are excluded and certain parts are focused which is known as qualitative change. The third division simplifying is replacing certain text so that it becomes more accessible to the learners and simplifying an activity to make it more understandable. Reordering is the fourth division in which the activities are sequenced in a different way so that the material makes a more pedagogical sense. Replacing is the final division where a part or a session of the material is substituted with other concepts.\nNegotiated curriculum:\nA negotiated curriculum is where both the teacher and the students discuss together in regards with the preparation of the curriculum. It facilitates the learners by providing them an opportunity to share the task of curriculum preparation through the process of negotiation with the teachers. The negotiated curriculum is nothing but the discussion between all the members of the classroom to decide how learning and teaching are to be organized. Lately the negotiated curriculum has gained importance in the field of curriculum designing in the language teaching due to the enhancement of the learner centeredness. It is quite difficult to prepare curriculum which appeals to the learners who come from a different socio – cultural and socio – economical background with different level of English needs and ability. When the process of curriculum making is carefully analyzed it can be seen that negotiated curriculum is nearly unavoidable in those situations. The reasons for using negotiated curriculum:\n• Where the teachers and students have a different background: In most of the cases there is a common situation in the language learning surrounding where the teacher and the learner are from the different background and do not know anything about each other and their lifestyle. They don’t have any idea about their way of thinking as they are from a different socio – culture and socio – economical background.\n• Where time is short and useful choices must be made: The most difficult and crucial part in the language teaching and learning process is the curriculum designing process and that is probably due to the shortage of time. Most of the time the prepared and fixed curriculum would not be appealing to the current set of learners so they do not get a proper learning experience. It is hard to find the appropriate curriculum for the diverse learners with the involvement of negotiated curriculum.\n• Where there is a diverse group of students so there is a need to find a common ground: Normally a language learning class has a diverse group of students from different variables like social, cultural ethnic and economic. Each student has a different reason, need and preference of learning the same particular language. In this situation there is a need to find a common structure of curriculum that will be appealing to all the students.\n• Where the initial need analysis is done: Need analysis that is conducted in order to get a clear-cut profile of the students in terms of their needs, lacks and wants is the most important part in the curriculum designing. The designing of the curriculum and preparing the syllabus that is appropriate for the learners leads to the situation of having a discussion with the learners of the particular classroom.\nMicro and Macro Level of Course Designing:\nGenerally, a language course will include many different types of syllabus strands. There are some courses which are based on multiple syllabus strands which are otherwise known as integrated syllabus. It also one of the most generally used approach in the adult and young-adult course today. In other case there are situation where only one syllable strand is used in the overall planning of the course which is referred as the macro level of course designing. Most of the skill-based course like writing and speaking will often be a part of the macro level.\nBackward Designing Instead of Forward Designing:\nMost of the curriculum is designed through a forward design lesson plan where the teacher initially chooses a topic from the language area then the teacher selects an appropriate resource for the topic. The teacher then chooses an instructional method based on the resource and the topic. Then the teacher chooses questions to assess the students’ understanding about the particular topic. The difficulties in the forward designing strategy are that it has a poorly constructed sequence of task that does not result in clear and expected outcome. And each activity sequence is often independently planned so there are often gaps in what learners need to know. An alternative approach is to begin from deciding what is the intended learning outcome and the outputs which reflect the outcomes. From this idea we should work backward and determine what is needed to be taught to achieve the outcome. This is known as backward designing. Backward designing starts from the specification of learning outcome then the decisions are taken on appropriate methodology and finally syllabus is developed from the learning outcome. According to Jack c. Richard (2013) most of the participants in his workshop typically assume that the best way to develop course material is to use the backward designing process as it provides the effective presentation for the determined outcome.\nConclusion:\nIn the preparation of curriculum there are various factors that are needed to be involved and taken care. In the present modern world, there are numbers of ways to design the curriculum. There are various published materials and authentic materials that can be utilized for the language learning process or can be utilized as the base for the development of our in – house material as not all course materials are effective and it’s the teachers’ duty to find the appropriate material for the students. While designing a curriculum and teaching material the first preference must be given to the learners’ need, preference, their present ability and their target ability in regard to the target language.",
    "date": "September 24, 2023",
    "id":"/b5a3c9d6"
  },
  {
    "img": "https://images.unsplash.com/photo-1532073145718-62df48eaa35e?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxzZWFyY2h8NHx8c3R1ZHklMjBhZXN0aGV0aWN8ZW58MHx8MHx8fDA%3D&w=1000&q=80",
    "topic": "Two Methods to Accelerate Your English Learning",
    "content": "You are not the only person who finds it difficult to master the language of the world – English. The first and most frequent obstacle you encounter while deciding to improve your communication skills is \"HOW to do it and WHERE to start from?\"\nThere are several resources available today, including movies, online worksheets, apps, and books, that can help you learn more about the English language. However, you can't be sure if you question, \"Do they provide a visible and a satisfied result?\" Despite all of these efforts, some language learners still struggle to grasp the intricacies of the language. This disadvantage is mostly a result of the fact that the majority of the ESL (English as a Second Language) learning process is built on the language and its rules rather than the learners and their immediate environment.\nWe must broaden our perspective beyond the several ESL sources that are readily available if we are to get past this negative filter. As a result, we are left with only two options for developing or enhancing our English communication skills. The two main approaches are LEARNING and ACQUIRING the language.\nBoth of these ideas centre on the student and his or her background to create an ESL learning strategy that is suitable for them.\n\nAcquiring the Language:\nWhere did you learn your mother tongue? Who instructed you? How many courses did you take?\nYou don’t have an answer right! Because when it comes to our mother tongue, you didn’t go to any separate school to learn it or no one taught you how to speak your mother tongue. Still, it remains the most convenient language to use. Moreover, you are more fluent in it than any other language you may learn.\nIt’s because you have acquired it!\nTo make it simple it can be said that when you listen and speak a language often it gets stored in our subconscious mind. Here you aren’t required to know the rules of the language and the learning process goes like this:\nYou listen You repeat You acquire\nThe major pro in this acquiring process is that the language stays in the subconscious level where it isn’t necessary to be revised often and doesn’t get vanished easily.\nDue to this approach the learners in non – English speaking surrounding would find it difficult to acquire the language. Whereas the learners in an English-speaking surrounding grab the communicating skill without much effort. Apart from that it might also take a long period of time to acquire the language for an adult when compared with a kid. Kids’ fresh and unloaded mind naturally have the acquiring capacity more than adults. As a result, kids acquire a language faster than an adult.\nThis is how as a kid you acquired your mother tongue without any effort.\n\nLearning the Language:\nWhen your non – English speaking surrounding or your adult mindset doesn’t co-operate for acquiring a language, this learning method comes to the rescue. It can also be called as a short cut method to improve your language. But it requires a lot of effort.\nEvery grammar rule of the language is being learned and practised in order to understand the language. You might be depended on the rules for a certain period of time until you get enough of practise and get along with the flow. Reading and writing are the major skills utilised in this method of learning the language.\nYou read You write You learn\nLearner who doesn’t have enough opportunity to communicate in a non-English speaking surrounding can opt this way of learning to improve their knowledge. A lot of determination is needed from the learner’s side as the knowledge learned settles on the conscious mind. Constant practise is being recommended to keep in touch with the skill developed until it comes out spontaneously.\nDetermine which area of enhancement you would fit in (ACQUIRING OR LEARNING) before diving into the sea of ESL learning resources. Subsequently, choose your ESL sources according on that. This sort of approach would better direct you by recognizing your ideal learning atmosphere.",
    "date": "September 17, 2023",
    "id":"/c72e8b3f"
  }
]
